#!C:\Python27\python.exe
# -*- coding: UTF-8 -*-
'''
@author: sunyx
企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，
从键盘输入当月利润I，求应发放奖金总数？
'''
def t(i):
    t1 = 0.1
    t2 = 0.075
    t4 = 0.05
    t6 = 0.03
    t10 = 0.015
    t11 = 0.01
    t = 0
    if i >= 0:
        if i <= 100000:
            t = i * t1
        elif i <= 200000:
            t = (i-100000)*t2 + 100000*t1
        elif i <= 400000:
            t = (i-200000)*t4+100000*t2 + 100000*t1
        elif i <= 600000:
            t = (i-400000)*t6 + 200000*t4 + 100000*t2 + 100000*t1
        elif i <= 1000000:
            t = (i-600000)*t10 +200000*t6 + 200000*t4 + 100000*t2 + 100000*t1
        else:
            t = (i-1000000)*t11 +400000*t10 + 200000*t6 + 200000*t4 + 100000*t2 + 100000*t1
    return t

#print '请输入收入额:',t(input())

def t2(i):
    tc = 0
    arr = [1000000,600000,400000,200000,100000,0]
    tcl = [0.01,0.015,0.03,0.05,0.075,0.1]
    for j in range(0,len(arr)):
        if i > arr[j]:
            tc = tc +(i-arr[j])*tcl[j]
            print (i-arr[j])*tcl[j]
            i = arr[j]
    return tc

print '请输入利润:',t2(input())